# Brewfile to be used with `brew bundle`

# Taps
tap "homebrew/bundle"
tap "homebrew/core"
tap "caskroom/cask"

# Formulae
brew "zsh"
brew "git"
brew "htop"
brew "tmux"
brew "tree"
brew "the_silver_searcher"
brew "ripgrep"
brew "vim"
brew "hugo"
brew "jq"

# Casks
cask "iterm2"
cask "firefox"
cask "mactex"
cask "wireshark"
cask "spotify"
cask "dash"
cask "visual-studio-code"
cask "franz"
cask "emacs"
