# Brewfile to be used with `brew bundle`

# Taps
tap "homebrew/bundle"
tap "homebrew/core"
tap "caskroom/cask"

# Formulae
brew "git"
brew "htop"
brew "valgrind"
brew "tmux"
brew "vim"
brew "python"
brew "python3"
brew "leiningen"
brew "stack"
brew "zsh"
brew "tree"
brew "yarn"
brew "pandoc"
brew "emacs", args: ["with-cocoa"]

# Casks
cask "java"
cask "iterm2"
cask "firefox"
cask "mactex"
cask "wireshark"
cask "spotify"
cask "dash"
cask "visual-studio-code"
cask "franz"
